// 2. Юзер вводить розмір масиву. Заповнити новостворений масив рандомними
// (ЦІЛИМИ) значеннями та порахувати їх середнє арифметичне. Вивести цей масив на екран, та результат розрахунку.

let a = prompt('Введите количество элементов в массиве: ')
a=Number(a)
let c = 0
let array = []
for (let i = 0; i < a; i++) {
    let b = Math.floor(Math.random() * 100)
    array.push(b);
    c = c + b
}
alert('Массив: ' + array)
alert("Среднее арифметическое всех элементов массива: " + c / a)

