// 5. Юзер вводить розмірність двовимірного масиву. NxM ( де N та M цілі числа що відповідають розміру виміру массиву).
// Юзер вводить якесь число K. Заповинити массив рандомними числами (від'ємними та невідємними) та вивести його красиво на екран, ' +
// 'та порахувати кількість елементів, що кратні K. Якщо є дублікати кратних чисел то їх не виводити.

let m = prompt('Ширина массива: ')
m=Number(m)
let n = prompt('Длина массива: ')
let arr = []
let a = []
let p='__ '
let k = prompt('Число k: ')
console.log("Массив чисел: ")

console.log(p.repeat(m))


for (let i = 0; i < n; i++) {
    arr[i] = [];

    for (let j = 0; j < m; j++) {
        arr[i][j] = Math.floor((Math.random() * 10) + (Math.random() * (-10)))

        if (arr[i][j] % k === 0 && !a.includes(arr[i][j])) {
            a.push(arr[i][j])
        }
    }
    console.log('|' + arr[i] + '|')



}
console.log(p.repeat(m))
alert("Числа, кратные k: " + a)
//вывод массива в консоль